; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 121103 2 2 4 6 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared3 - mode
	infrared1 - mode
	image0 - mode
	infrared2 - mode
	GroundStation0 - direction
	GroundStation5 - direction
	Star3 - direction
	Star2 - direction
	Star1 - direction
	Star4 - direction
	Star6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared2)
	(supports instrument1 infrared3)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared3)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 infrared2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (turn_to satellite0 star1 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star1)
   goals met: 1 of 3
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 3
4. (turn_to satellite1 star6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star6)
   goals met: 1 of 3
5. (turn_to satellite1 star2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star2)
   goals met: 1 of 3
6. (turn_to satellite0 groundstation0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 3
7. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 3
8. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 3
9. (turn_to satellite1 star6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star6)
   goals met: 0 of 3
10. (turn_to satellite0 star1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star1)
   goals met: 1 of 3
11. (take_image satellite1 star6 instrument2 infrared1)
   added: (have_image star6 infrared1)
   goals met: 2 of 3
12. (turn_to satellite0 phenomenon7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 3
13. (take_image satellite0 phenomenon7 instrument1 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 2 of 3
14. (turn_to satellite0 star1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star1)
   goals met: 3 of 3
